DevOpsOfChaos/ESP32-SMART-HOME/firmware/src/master/main.cpp
        case SH_CLASS_NET_SEN:
            schreibeIntOrNull(tempText, sizeof(tempText), nodeStates[nodeIndex].temp_01c, INT16_MIN);
            schreibeUIntOrNull(humText, sizeof(humText), nodeStates[nodeIndex].hum_01pct, 0xFFFFU);
            schreibeUIntOrNull(luxText, sizeof(luxText), nodeStates[nodeIndex].lux, 0xFFFFU);
            snprintf(
                buffer,
                bufferSize,
                "{\"node_id\":\"%s\",\"temp_01c\":%s,\"hum_01pct\":%s,\"lux\":%s,\"motion\":%s,\"fault\":%s}",
                NODE_DEFINITIONS[nodeIndex].node_id,
                tempText,
                humText,
                luxText,
                nodeStates[nodeIndex].motion ? "true" : "false",
                nodeStates[nodeIndex].fault ? "true" : "false");
            return;

        case SH_CLASS_BAT_SEN:
            schreibeUIntOrNull(batteryPctText, sizeof(batteryPctText), nodeStates[nodeIndex].battery_pct, 0xFFU);
            schreibeUIntOrNull(batteryMvText, sizeof(batteryMvText), nodeStates[nodeIndex].battery_mv, 0U);
            schreibeUIntOrNull(windowText, sizeof(windowText), nodeStates[nodeIndex].window_open, WINDOW_STATE_UNKNOWN);
            schreibeUIntOrNull(rainText, sizeof(rainText), nodeStates[nodeIndex].rain_raw, 0xFFFFU);
            snprintf(
                buffer,
                bufferSize,
                "{\"node_id\":\"%s\",\"battery_pct\":%s,\"battery_mv\":%s,\"window_open\":%s,\"rain_raw\":%s,\"button_flags\":%u,\"fault\":%s}",
                NODE_DEFINITIONS[nodeIndex].node_id,
                batteryPctText,
                batteryMvText,
                windowText,
                rainText,
                (unsigned)nodeStates[nodeIndex].button_flags,
                nodeStates[nodeIndex].fault ? "true" : "false");
            return;

        default:
            copyText(buffer, bufferSize, "{}");
            return;
    }
}

void baueNodeEventJson(size_t nodeIndex, const SmartHome::EventReportPayload& payload, char* buffer, size_t bufferSize) {
    snprintf(
        buffer,
        bufferSize,
        "{\"node_id\":\"%s\",\"event\":\"%s\",\"event_type\":%u,\"trigger\":%u,\"param1\":%u,\"param2\":%u}",
        NODE_DEFINITIONS[nodeIndex].node_id,
        eventTypeText(payload.event_type),
        (unsigned)payload.event_type,
        (unsigned)payload.trigger,
        (unsigned)payload.param1,
        (unsigned)payload.param2);
}

void publishRetained(const char* topic, const char* payload) {
    if (!masterStatus.mqtt_verbunden) return;

    if (!mqttClient.publish(topic, payload, true)) {
        logf("WARN", "MQTT publish fehlgeschlagen: %s", topic);
        return;
    }

    logf("INFO", "MQTT retained %s -> %s", topic, payload);
}

void publishTransient(const char* topic, const char* payload) {
    if (!masterStatus.mqtt_verbunden) return;

    if (!mqttClient.publish(topic, payload, false)) {
        logf("WARN", "MQTT publish fehlgeschlagen: %s", topic);
        return;
    }

    logf("INFO", "MQTT publish %s -> %s", topic, payload);
}

void publishMasterStatus() {
    char topic[96] = {0};
    char payload[192] = {0};
    baueMasterTopic("status", topic, sizeof(topic));
    baueMasterStatusJson(payload, sizeof(payload), true);
    publishRetained(topic, payload);
}

void publishMasterEvent(const char* eventName) {
    char topic[96] = {0};
    char payload[224] = {0};
    baueMasterTopic("event", topic, sizeof(topic));
    baueMasterEventJson(payload, sizeof(payload), eventName);
    publishTransient(topic, payload);
}

void publishNodeMeta(size_t nodeIndex) {
    if (!nodeStates[nodeIndex].meta_bekannt) return;

    char topic[96] = {0};
    char payload[224] = {0};
    baueNodeTopic(nodeIndex, "meta", topic, sizeof(topic));
    baueNodeMetaJson(nodeIndex, payload, sizeof(payload));
    publishRetained(topic, payload);
}

void publishNodeStatus(size_t nodeIndex, bool online) {
    char topic[96] = {0};
    char payload[192] = {0};
    baueNodeTopic(nodeIndex, "status", topic, sizeof(topic));
    baueNodeStatusJson(nodeIndex, payload, sizeof(payload), online);
    publishRetained(topic, payload);
}

void publishNodeState(size_t nodeIndex) {
    if (!nodeStates[nodeIndex].state_bekannt) return;

    char topic[96] = {0};
    char payload[224] = {0};
    baueNodeTopic(nodeIndex, "state", topic, sizeof(topic));
    baueNodeStateJson(nodeIndex, payload, sizeof(payload));
    publishRetained(topic, payload);
}

void publishNodeEvent(size_t nodeIndex, const SmartHome::EventReportPayload& payload) {
    char topic[96] = {0};
    char json[224] = {0};
    baueNodeTopic(nodeIndex, "event", topic, sizeof(topic));
    baueNodeEventJson(nodeIndex, payload, json, sizeof(json));
    publishTransient(topic, json);
}

void publishNodeAckPayload(size_t nodeIndex, const char* ackPayload) {
    if (!ackPayload || ackPayload[0] == '\0') return;

    char topic[96] = {0};
    baueNodeTopic(nodeIndex, "ack", topic, sizeof(topic));
    publishTransient(topic, ackPayload);
}

void speichereCommandAckCache(size_t nodeIndex, const char* requestId, const char* ackPayload) {
    if (!requestId || requestId[0] == '\0' || !ackPayload || ackPayload[0] == '\0') {
        return;
    }

    commandAckCache = {};
    commandAckCache.gueltig = true;
    commandAckCache.node_index = nodeIndex;
    commandAckCache.gespeichert_ms = millis();
    copyText(commandAckCache.request_id, sizeof(commandAckCache.request_id), requestId);
    copyText(commandAckCache.ack_payload, sizeof(commandAckCache.ack_payload), ackPayload);
}

void sendeCommandAckMqtt(
    size_t nodeIndex,
    const char* requestId,
    const char* statusText,
    int statusCode,
    uint8_t ackMsgType,
    uint8_t ackSeq,
    uint8_t versuche,
    const char* source,
    bool retryExhausted,
    bool inCacheMerken)
{
    char ackPayload[256] = {0};
    const uint8_t retryCount = versuche > 0U ? (uint8_t)(versuche - 1U) : 0U;
    snprintf(
        ackPayload,
        sizeof(ackPayload),
        "{\"node_id\":\"%s\",\"request_id\":\"%s\",\"channel\":\"cmd/set\",\"status\":\"%s\",\"status_code\":%d,\"ack_msg_type\":%u,\"ack_seq\":%u,\"attempts\":%u,\"retry_count\":%u,\"retry_exhausted\":%s,\"source\":\"%s\"}",
        NODE_DEFINITIONS[nodeIndex].node_id,
        requestId ? requestId : "",
        statusText ? statusText : "unknown",
        statusCode,
        (unsigned)ackMsgType,
        (unsigned)ackSeq,
        (unsigned)versuche,
        (unsigned)retryCount,
        retryExhausted ? "true" : "false",
        source ? source : "master");

