DevOpsOfChaos/ESP32-SMART-HOME/firmware/src/master/main.cpp
    publishNodeAckPayload(nodeIndex, ackPayload);
    if (inCacheMerken) {
        speichereCommandAckCache(nodeIndex, requestId, ackPayload);
    }
}

void publishBekannteNodesNachReconnect() {
    publishMasterStatus();
    publishMasterEvent("mqtt_connected");

    for (size_t i = 0; i < NODE_COUNT; ++i) {
        publishNodeMeta(i);
        publishNodeStatus(i, nodeStates[i].online);
        publishNodeState(i);
    }
}

void aktualisiereNodeKontakt(size_t nodeIndex, const uint8_t* mac) {
    nodeStates[nodeIndex].letzter_kontakt_ms = millis();

    if (mac != nullptr) {
        bool neueMac = !nodeStates[nodeIndex].mac_bekannt ||
                       memcmp(nodeStates[nodeIndex].mac, mac, 6) != 0;
        memcpy(nodeStates[nodeIndex].mac, mac, 6);
        nodeStates[nodeIndex].mac_bekannt = true;
        stellePeerSicher(nodeStates[nodeIndex].mac);

        if (neueMac) {
            char text[18] = {0};
            macText(mac, text, sizeof(text));
            logf("INFO", "%s MAC aktualisiert: %s", NODE_DEFINITIONS[nodeIndex].node_id, text);
        }
    }

    if (!nodeStates[nodeIndex].online) {
        nodeStates[nodeIndex].online = true;
        publishNodeStatus(nodeIndex, true);
        logf("INFO", "Node %s ist online", NODE_DEFINITIONS[nodeIndex].node_id);
    }
}

void sendeHelloAck(const uint8_t* zielMac, uint8_t ackStatus) {
    SmartHome::HelloAckPayload payload = {};
    payload.channel = (uint8_t)(masterStatus.wlan_verbunden ? WiFi.channel() : WLAN_KANAL);
    payload.ack_status = ackStatus;
    sendePaket(zielMac, SH_MSG_HELLO_ACK, &payload, sizeof(payload), "HELLO_ACK");
}

bool wiederholePendingCommand() {
    if (!pendingCommand.aktiv) return false;

    const size_t nodeIndex = pendingCommand.node_index;
    if (nodeIndex >= NODE_COUNT || !nodeStates[nodeIndex].mac_bekannt) {
        logf("WARN", "Retry verworfen: MAC fuer %s unbekannt", NODE_DEFINITIONS[nodeIndex].node_id);
        return false;
    }

    SmartHome::CmdPayload payload = {};
    payload.cmd_type = SH_CMD_SET_RELAY;
    payload.param1 = pendingCommand.relay_index;
    payload.param2 = pendingCommand.relay_state ? 1U : 0U;

    const bool erfolgreich = sendePaketMitOptionen(
        nodeStates[nodeIndex].mac,
        SH_MSG_CMD,
        &payload,
        sizeof(payload),
        "COMMAND_SET_RELAY retry",
        (uint8_t)(SH_FLAG_ACK_REQUEST | SH_FLAG_RETRANSMIT),
        true,
        pendingCommand.seq,
        nullptr);

    if (erfolgreich) {
        pendingCommand.versuche++;
        pendingCommand.letztes_senden_ms = millis();
        logf(
            "WARN",
            "Retry %u/%u fuer %s request_id=%s seq=%u",
            (unsigned)(pendingCommand.versuche - 1U),
            (unsigned)COMMAND_MAX_RETRIES,
            NODE_DEFINITIONS[nodeIndex].node_id,
            pendingCommand.request_id,
            (unsigned)pendingCommand.seq);
    }

    return erfolgreich;
}

void verarbeiteAck(const uint8_t* senderMac, const SmartHome::AckPayload& payload) {
    const int nodeIndex = findeNodeIndexPerMac(senderMac);
    if (nodeIndex < 0) {
        logf("WARN", "ACK ignoriert: unbekannte Sender-MAC");
        return;
    }

    if (!pendingCommand.aktiv || pendingCommand.node_index != (size_t)nodeIndex) {
        logf("WARN", "ACK ignoriert: kein offenes Kommando fuer %s", NODE_DEFINITIONS[nodeIndex].node_id);
        return;
    }

    if (payload.ack_msg_type != SH_MSG_CMD || payload.ack_seq != pendingCommand.seq) {
        logf(
            "WARN",
            "ACK ignoriert: seq/msg_type passen nicht (seq=%u, msg_type=%u)",
            (unsigned)payload.ack_seq,
            (unsigned)payload.ack_msg_type);
        return;
    }

    const char* statusText = "error";
    switch (payload.status) {
        case SH_ACK_OK:
            statusText = "ok";
            break;
        case SH_ACK_REJECTED:
            statusText = "rejected";
            break;
        default:
            statusText = "error";
            break;
    }

    sendeCommandAckMqtt(
        (size_t)nodeIndex,
        pendingCommand.request_id,
        statusText,
        (int)payload.status,
        payload.ack_msg_type,
        payload.ack_seq,
        pendingCommand.versuche,
        "node_ack",
        false,
        true);

    logf(
        "INFO",
        "ACK von %s fuer request_id=%s seq=%u status=%u",
        NODE_DEFINITIONS[nodeIndex].node_id,
        pendingCommand.request_id,
        (unsigned)payload.ack_seq,
        (unsigned)payload.status);

    pendingCommand = {};
}

bool skipWhitespace(const char*& cursor) {
    if (cursor == nullptr) return false;
    while (*cursor != '\0' && isspace((unsigned char)*cursor)) {
        cursor++;
    }
    return *cursor != '\0';
}

bool jsonHoleString(const char* json, const char* key, char* ziel, size_t zielGroesse) {
    if (!json || !key || !ziel || zielGroesse == 0U) return false;

    char muster[48] = {0};
    snprintf(muster, sizeof(muster), "\"%s\"", key);
    const char* fund = strstr(json, muster);
    if (!fund) return false;

    const char* cursor = strchr(fund + strlen(muster), ':');
    if (!cursor) return false;
    cursor++;
    if (!skipWhitespace(cursor) || *cursor != '"') return false;
    cursor++;

    const char* ende = strchr(cursor, '"');
    if (!ende) return false;

    size_t len = (size_t)(ende - cursor);
    if (len >= zielGroesse) len = zielGroesse - 1U;
    memcpy(ziel, cursor, len);
    ziel[len] = '\0';
    return true;
}

bool jsonHoleBool(const char* json, const char* key, bool* wert) {
    if (!json || !key || !wert) return false;

    char muster[48] = {0};
    snprintf(muster, sizeof(muster), "\"%s\"", key);
    const char* fund = strstr(json, muster);
    if (!fund) return false;

    const char* cursor = strchr(fund + strlen(muster), ':');
    if (!cursor) return false;
    cursor++;
    if (!skipWhitespace(cursor)) return false;

    if (strncmp(cursor, "true", 4) == 0) {
        *wert = true;
        return true;
    }
    if (strncmp(cursor, "false", 5) == 0) {
        *wert = false;
        return true;
    }
    return false;
}

bool extrahiereNodeCommandTopic(const char* topic, char* nodeId, size_t nodeIdSize, bool* istSet, bool* istGet) {
    if (!topic || !nodeId || nodeIdSize == 0U || !istSet || !istGet) return false;

    const char* prefix = "smarthome/node/";
    const size_t prefixLen = strlen(prefix);
    if (strncmp(topic, prefix, prefixLen) != 0) return false;

    const char* start = topic + prefixLen;
    const char* slash = strchr(start, '/');
    if (!slash) return false;

