DevOpsOfChaos/ESP32-SMART-HOME/firmware/src/master/main.cpp
void verarbeiteEspNowPaket(const uint8_t* senderMac, const uint8_t* daten, int laenge) {
    if (!senderMac || !daten || laenge < (int)sizeof(SmartHome::MsgHeader)) {
        logf("WARN", "ESP-NOW Paket verworfen: ungueltige Eingabe");
        return;
    }

    if (!SmartHome::hasValidPacketCrc(daten, (size_t)laenge)) {
        logf("WARN", "ESP-NOW Paket verworfen: CRC/Header ungueltig");
        return;
    }

    const SmartHome::MsgHeader* header = reinterpret_cast<const SmartHome::MsgHeader*>(daten);
    const uint8_t* payload = daten + SH_HEADER_SIZE;

    switch (header->msg_type) {
        case SH_MSG_HELLO:
            if (header->payload_len == sizeof(SmartHome::HelloPayload)) {
                verarbeiteHello(senderMac, *reinterpret_cast<const SmartHome::HelloPayload*>(payload));
            }
            break;

        case SH_MSG_HEARTBEAT:
            if (header->payload_len == sizeof(SmartHome::HeartbeatPayload)) {
                verarbeiteHeartbeat(senderMac, *reinterpret_cast<const SmartHome::HeartbeatPayload*>(payload));
            }
            break;

        case SH_MSG_STATE:
            verarbeiteStateReport(senderMac, payload, header->payload_len);
            break;

        case SH_MSG_EVENT:
            if (header->payload_len == sizeof(SmartHome::EventReportPayload)) {
                verarbeiteEventReport(senderMac, *reinterpret_cast<const SmartHome::EventReportPayload*>(payload));
            }
            break;

        case SH_MSG_ACK:
            if (header->payload_len == sizeof(SmartHome::AckPayload)) {
                verarbeiteAck(senderMac, *reinterpret_cast<const SmartHome::AckPayload*>(payload));
            }
            break;

        default:
            logf("WARN", "ESP-NOW Nachricht ignoriert (msg_type=%u)", header->msg_type);
            break;
    }
}

#if ESP_ARDUINO_VERSION_MAJOR >= 3
void onEspNowReceive(const esp_now_recv_info_t* info, const uint8_t* daten, int laenge) {
    if (info == nullptr) return;
    verarbeiteEspNowPaket(info->src_addr, daten, laenge);
}
#else
void onEspNowReceive(const uint8_t* senderMac, const uint8_t* daten, int laenge) {
    verarbeiteEspNowPaket(senderMac, daten, laenge);
}
#endif

void onEspNowSent(const uint8_t* mac, esp_now_send_status_t status) {
    char text[18] = {0};
    macText(mac, text, sizeof(text));
    logf(
        status == ESP_NOW_SEND_SUCCESS ? "INFO" : "WARN",
        "ESP-NOW Sendestatus an %s: %s",
        text,
        status == ESP_NOW_SEND_SUCCESS ? "OK" : "FEHLER");
}

bool sendeStateRequest(size_t nodeIndex) {
    if (!nodeStates[nodeIndex].mac_bekannt) {
        logf("WARN", "STATE_REQUEST verworfen: MAC fuer %s unbekannt", NODE_DEFINITIONS[nodeIndex].node_id);
        return false;
    }

    SmartHome::CmdPayload payload = {};
    payload.cmd_type = SH_CMD_STATE_REQUEST;
    return sendePaket(nodeStates[nodeIndex].mac, SH_MSG_CMD, &payload, sizeof(payload), "STATE_REQUEST");
}

bool sendeRelayCommand(size_t nodeIndex, uint8_t relayIndex, bool relayState, const char* requestId) {
    if (!nodeStates[nodeIndex].mac_bekannt) {
        logf("WARN", "COMMAND_SET_RELAY verworfen: MAC fuer %s unbekannt", NODE_DEFINITIONS[nodeIndex].node_id);
        return false;
    }

    SmartHome::CmdPayload payload = {};
    payload.cmd_type = SH_CMD_SET_RELAY;
    payload.param1 = relayIndex;
    payload.param2 = relayState ? 1U : 0U;

    if (!nutztCommandAckPfad(nodeIndex)) {
        return sendePaket(nodeStates[nodeIndex].mac, SH_MSG_CMD, &payload, sizeof(payload), "COMMAND_SET_RELAY");
    }

    uint8_t seq = 0U;
    const bool erfolgreich = sendePaketMitOptionen(
        nodeStates[nodeIndex].mac,
        SH_MSG_CMD,
        &payload,
        sizeof(payload),
        "COMMAND_SET_RELAY",
        SH_FLAG_ACK_REQUEST,
        false,
        0U,
        &seq);

    if (!erfolgreich) {
        return false;
    }

    pendingCommand = {};
    pendingCommand.aktiv = true;
    pendingCommand.node_index = nodeIndex;
    pendingCommand.seq = seq;
    pendingCommand.relay_index = relayIndex;
    pendingCommand.relay_state = relayState;
    pendingCommand.versuche = 1U;
    pendingCommand.letztes_senden_ms = millis();
    copyText(pendingCommand.request_id, sizeof(pendingCommand.request_id), requestId);
    return true;
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
    char json[256] = {0};
    size_t copyLen = length;
    if (copyLen >= sizeof(json)) copyLen = sizeof(json) - 1U;
    memcpy(json, payload, copyLen);
    json[copyLen] = '\0';

    char nodeId[SH_DEVICE_ID_LEN] = {0};
    bool istSet = false;
    bool istGet = false;
    if (!extrahiereNodeCommandTopic(topic, nodeId, sizeof(nodeId), &istSet, &istGet)) {
        logf("WARN", "MQTT Topic ignoriert: %s", topic);
        return;
    }

    int nodeIndex = findeNodeIndex(nodeId);
    if (nodeIndex < 0) {
        logf("WARN", "MQTT Command fuer unbekannte node_id=%s", nodeId);
        return;
    }

    logf("INFO", "MQTT empfangen %s -> %s", topic, json);

    char cmd[32] = {0};
    jsonHoleString(json, "cmd", cmd, sizeof(cmd));

    if (istGet) {
        if (strcmp(cmd, "state") != 0 && strcmp(cmd, "get_state") != 0) {
            logf("WARN", "MQTT cmd/get ignoriert fuer %s", nodeId);
            return;
        }

        sendeStateRequest((size_t)nodeIndex);
        return;
    }

    if (!istRelayNode((size_t)nodeIndex)) {
        logf("WARN", "MQTT set_relay ignoriert: %s ist kein Relais-Node", nodeId);
        return;
    }

    if (strcmp(cmd, "set_relay") != 0) {
        logf("WARN", "MQTT cmd/set ignoriert fuer %s", nodeId);
        return;
    }

    char requestId[REQUEST_ID_LEN] = {0};
    const bool ackPfadAktiv = nutztCommandAckPfad((size_t)nodeIndex);
    if (ackPfadAktiv) {
        if (!jsonHoleString(json, "request_id", requestId, sizeof(requestId))) {
            snprintf(requestId, sizeof(requestId), "master_%s_%lu", nodeId, millis());
            logf("WARN", "MQTT cmd/set ohne request_id fuer %s, fallback=%s", nodeId, requestId);
        }

        pruefeCommandAckCacheAblauf();

        if (pendingCommand.aktiv && pendingCommand.node_index == (size_t)nodeIndex) {
            if (gleicheRequestId(pendingCommand.request_id, requestId)) {
                logf("WARN", "Duplikat request_id waehrend Pending ignoriert: %s", requestId);
                return;
            }

            sendeCommandAckMqtt(
                (size_t)nodeIndex,
                requestId,
                "busy",
                -2,
                SH_MSG_CMD,
                pendingCommand.seq,
                pendingCommand.versuche,
                "master_busy",
                false,
                false);
            logf("WARN", "Neues Kommando fuer %s verworfen, solange request_id=%s offen ist", nodeId, pendingCommand.request_id);
            return;
        }

        if (commandAckCache.gueltig &&
            commandAckCache.node_index == (size_t)nodeIndex &&
            gleicheRequestId(commandAckCache.request_id, requestId)) {
            publishNodeAckPayload((size_t)nodeIndex, commandAckCache.ack_payload);
            logf("INFO", "Duplikat request_id erkannt, cached ACK erneut publiziert: %s", requestId);
            return;
        }
    }

    bool relayState = false;
    if (jsonHoleBool(json, "relay_1", &relayState)) {
        sendeRelayCommand((size_t)nodeIndex, 0U, relayState, requestId);
        return;
    }

    if (NODE_DEFINITIONS[nodeIndex].device_class == SH_CLASS_NET_ZRL &&
        jsonHoleBool(json, "relay_2", &relayState)) {
        sendeRelayCommand((size_t)nodeIndex, 1U, relayState, requestId);
        return;
    }

