DevOpsOfChaos/ESP32-SMART-HOME/firmware/src/master/main.cpp
    logf("WARN", "MQTT set_relay ohne unterstuetzten Kanal fuer %s", nodeId);
}

void initialisiereHardware() {
    if (PIN_STATUS_LED >= 0) {
        pinMode(PIN_STATUS_LED, OUTPUT);
        digitalWrite(PIN_STATUS_LED, LOW);
    }
}

void initialisiereWlan() {
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    masterStatus.letzter_wlan_versuch_ms = millis();
    logf("INFO", "WLAN-Verbindung gestartet: SSID=%s", WIFI_SSID);
}

void pruefeWlanVerbindung() {
    bool verbunden = (WiFi.status() == WL_CONNECTED);
    if (verbunden != masterStatus.wlan_verbunden) {
        masterStatus.wlan_verbunden = verbunden;
        if (verbunden) {
            logf("INFO", "WLAN verbunden: IP=%s Kanal=%d", WiFi.localIP().toString().c_str(), WiFi.channel());
        } else {
            logf("WARN", "WLAN getrennt");
        }
    }

    if (!verbunden && (millis() - masterStatus.letzter_wlan_versuch_ms) >= WIFI_RECONNECT_INTERVAL_MS) {
        WiFi.disconnect();
        WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
        masterStatus.letzter_wlan_versuch_ms = millis();
        logf("INFO", "WLAN-Reconnect gestartet");
    }
}

void initialisiereEspNow() {
    if (!masterStatus.wlan_verbunden) {
        esp_wifi_set_channel((uint8_t)WLAN_KANAL, WIFI_SECOND_CHAN_NONE);
    }

    if (esp_now_init() != ESP_OK) {
        masterStatus.espnow_bereit = false;
        logf("WARN", "ESP-NOW Initialisierung fehlgeschlagen");
        return;
    }

    esp_now_register_send_cb(onEspNowSent);
    esp_now_register_recv_cb(onEspNowReceive);
    masterStatus.espnow_bereit = true;
    logf("INFO", "ESP-NOW bereit");
}

void initialisiereMqtt() {
    mqttClient.setServer(MQTT_HOST, MQTT_PORT);
    mqttClient.setCallback(mqttCallback);
    mqttClient.setBufferSize(384);
    logf("INFO", "MQTT konfiguriert: %s:%d", MQTT_HOST, MQTT_PORT);
}

void pruefeMqttVerbindung() {
    if (!masterStatus.wlan_verbunden) {
        if (masterStatus.mqtt_verbunden) {
            mqttClient.disconnect();
            masterStatus.mqtt_verbunden = false;
        }
        return;
    }

    if (mqttClient.connected()) {
        mqttClient.loop();
        if (!masterStatus.mqtt_verbunden) {
            masterStatus.mqtt_verbunden = true;
        }
        return;
    }

    masterStatus.mqtt_verbunden = false;
    if ((millis() - masterStatus.letzter_mqtt_versuch_ms) < MQTT_RECONNECT_INTERVAL_MS) {
        return;
    }

    masterStatus.letzter_mqtt_versuch_ms = millis();

    char willTopic[96] = {0};
    char willPayload[192] = {0};
    baueMasterTopic("status", willTopic, sizeof(willTopic));
    baueMasterStatusJson(willPayload, sizeof(willPayload), false);

    bool verbunden = mqttClient.connect(
        DEVICE_ID,
        MQTT_USER,
        MQTT_PASSWORD,
        willTopic,
        0,
        true,
        willPayload,
        true);

    if (!verbunden) {
        logf("WARN", "MQTT connect fehlgeschlagen (state=%d)", mqttClient.state());
        return;
    }

    masterStatus.mqtt_verbunden = true;
    logf("INFO", "MQTT verbunden");

    if (!mqttClient.subscribe(MQTT_TOPIC_CMD_SET_SUB)) {
        logf("WARN", "MQTT Subscribe fehlgeschlagen: %s", MQTT_TOPIC_CMD_SET_SUB);
    }
    if (!mqttClient.subscribe(MQTT_TOPIC_CMD_GET_SUB)) {
        logf("WARN", "MQTT Subscribe fehlgeschlagen: %s", MQTT_TOPIC_CMD_GET_SUB);
    }

    publishBekannteNodesNachReconnect();
}

void pruefeCommandAckTimeout() {
    pruefeCommandAckCacheAblauf();

    if (!pendingCommand.aktiv) return;

    if ((millis() - pendingCommand.letztes_senden_ms) < COMMAND_ACK_TIMEOUT_MS) {
        return;
    }

    if ((pendingCommand.versuche - 1U) < COMMAND_MAX_RETRIES) {
        if (wiederholePendingCommand()) {
            return;
        }
    }

    sendeCommandAckMqtt(
        pendingCommand.node_index,
        pendingCommand.request_id,
        "timeout",
        (int)SH_ERROR_ACK_TIMEOUT,
        SH_MSG_CMD,
        pendingCommand.seq,
        pendingCommand.versuche,
        "master_retry_timeout",
        true,
        true);

    logf(
        "WARN",
        "ACK Timeout fuer %s request_id=%s seq=%u nach %u Versuchen",
        NODE_DEFINITIONS[pendingCommand.node_index].node_id,
        pendingCommand.request_id,
        (unsigned)pendingCommand.seq,
        (unsigned)pendingCommand.versuche);

    pendingCommand = {};
}

void pruefeOfflineTimeout() {
    for (size_t i = 0; i < NODE_COUNT; ++i) {
        if (!nodeStates[i].online) continue;

        if ((millis() - nodeStates[i].letzter_kontakt_ms) > NODE_DEFINITIONS[i].offline_timeout_ms) {
            nodeStates[i].online = false;
            publishNodeStatus(i, false);
            logf("WARN", "Node %s nach Timeout offline", NODE_DEFINITIONS[i].node_id);
        }
    }
}

void gibStartmeldungAus() {
    if (!DEBUG_LOKAL_AKTIV) return;

    Serial.println("================================");
    Serial.println(PROJECT_NAME);
    Serial.print(DATEI_GERAET);
    Serial.print(" v");
    Serial.println(DATEI_VERSION);
    Serial.print("FW: ");
    Serial.println(PROJECT_VERSION);
    Serial.println("Bekannte Basisnodes:");
    for (size_t i = 0; i < NODE_COUNT; ++i) {
        Serial.print(" - ");
        Serial.print(NODE_DEFINITIONS[i].node_id);
        Serial.print(" (");
        Serial.print(NODE_DEFINITIONS[i].device_type);
        Serial.println(")");
    }
    Serial.println("MQTT: master/<id>/(status|event) und node/<id>/(meta|status|state|event)");
    Serial.println("================================");
}

void setup() {
    if (DEBUG_LOKAL_AKTIV) {
        Serial.begin(115200);
        delay(150);
    }

    masterStatus = {};
    initialisiereNodeStates();
    gibStartmeldungAus();
    initialisiereHardware();
    initialisiereWlan();
    delay(500);
    pruefeWlanVerbindung();
    initialisiereEspNow();
    initialisiereMqtt();
}

void loop() {
    pruefeWlanVerbindung();
    pruefeMqttVerbindung();
    pruefeCommandAckTimeout();
    pruefeOfflineTimeout();
    delay(LOOP_INTERVAL_MS);
}
